Revit 2024 API
ExporterIFCUtils.GetLoopsFromTopBottomFace Method
 Gets the curve loop(s) that represent the bottom or top face of the wall, usable to create an extrusion for the wall geometry.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static IList<CurveLoop> GetLoopsFromTopBottomFace(
	ExporterIFC exporterIFC,
	Wall wall
)
Visual Basic
Public Shared Function GetLoopsFromTopBottomFace ( _
	exporterIFC As ExporterIFC, _
	wall As Wall _
) As IList(Of CurveLoop)
Visual C++
public:
static IList<CurveLoop^>^ GetLoopsFromTopBottomFace(
	ExporterIFC^ exporterIFC,
	Wall^ wall
)
Parameters
exporterIFC
Type: Autodesk.Revit.DB.IFC.ExporterIFC
 The exporter.
wall
Type: Autodesk.Revit.DB.Wall
 The wall.
Return Value
 The curve loops. If the function has failed, this collection will be empty.
Remarks
 This function is intended to help determine if a Revit Wall can be exported as an IfcWallStandardCase. The conditions for exporting an IfcWallStandardCase require that the geometry of the wall be described as one profile curve loop extruded in the Z direction, with potential clip planes and openings applied to the base geometry. This function will use either the top or bottom face to determine the boundary curve loop. Regardless of whether the top or bottom face is used, the curve loop will be located on the plane corresponding to the base of the wall.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace